auth/app/controllers/accounts_controller.rb

UPDATE "accounts" SET "role" = $1, "full_name" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["role", "admin"], ["full_name", ""], ["updated_at", "2024-02-26 09:49:45.976505"], ["id", 3]]
---
  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_account
      @account = Account.find(params[:id])